<?php

//class Request
//{
//    public function getAllParams()
//    {
//        получает все параметры, ассоциативный массив ключ => значение
//    }
//    
//    public function getParam()
//    {
//        принимает параметры
//    }
//    
//    public function getMethod()
//    {
//        метод при вызове которого получать метод которым был передан этот запрос
//    }
//    
//    public function isAjax()
//    {
//        должен говорить использовался ли при передаче данных объект xmlhttprequest
//    }
//    
//    открыть суперглобальную переменную SERVER в нем есть request_method там должен быть параметр который получает тот метод который был передан на сервере.
//    HTTP_X_REQUESTED-WITH
//}